## ðŸ§® 6. GroupBy & Aggregation

## ðŸ§  What is groupby()?
The groupby() function in pandas is used to split the data into groups based on some criteria (column values), and then apply some aggregate function, transformation, or filtering on each group.

In [36]:
import pandas as pd

data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace'],
    'Salary': [50000, 60000, 70000, 80000, 75000, 40000, 42000],
    'Bonus': [5000, 6000, 7000, 8000, 7500, 3000, 3500]
}

df = pd.DataFrame(data)
df

  Department Employee  Salary  Bonus
0         HR    Alice   50000   5000
1         HR      Bob   60000   6000
2         IT  Charlie   70000   7000
3         IT    David   80000   8000
4         IT      Eva   75000   7500
5    Finance    Frank   40000   3000
6    Finance    Grace   42000   3500

## âœ… Step 1: Basic groupby()
ðŸ‘‰ Group by a column and get the average salary:

In [39]:
df.groupby('Department')['Salary'].mean()

Department
Finance    41000.0
HR         55000.0
IT         75000.0
Name: Salary, dtype: float64

## âœ… Step 2: Aggregation Functions
You can use:

.mean()

.sum()

.count()

.max()

.min()

.median()

.std(), .var() etc.

In [41]:
df.groupby('Department')['Salary'].sum()

Department
Finance     82000
HR         110000
IT         225000
Name: Salary, dtype: int64

In [42]:
df.groupby('Department')['Department'].count()

Department
Finance    2
HR         2
IT         3
Name: Department, dtype: int64

In [43]:
df.groupby('Department')['Bonus'].min()

Department
Finance    3000
HR         5000
IT         7000
Name: Bonus, dtype: int64

In [44]:
df.groupby('Department')['Bonus'].max()

Department
Finance    3500
HR         6000
IT         8000
Name: Bonus, dtype: int64

## âœ… Step 3: Aggregating Multiple Columns

In [45]:
df.groupby('Department')[['Salary', 'Bonus']].mean()

             Salary   Bonus
Department
Finance     41000.0  3250.0
HR          55000.0  5500.0
IT          75000.0  7500.0

In [46]:
df.groupby('Department')[['Salary', 'Bonus']].min()

            Salary  Bonus
Department
Finance      40000   3000
HR           50000   5000
IT           70000   7000

In [47]:
df.groupby('Department')[['Salary', 'Bonus']].max()

            Salary  Bonus
Department
Finance      42000   3500
HR           60000   6000
IT           80000   8000

In [48]:
df.groupby('Department').mean(numeric_only=True)

             Salary   Bonus
Department
Finance     41000.0  3250.0
HR          55000.0  5500.0
IT          75000.0  7500.0

## âœ… Step 4: Using .agg() for Multiple Aggregations

In [53]:
df.groupby('Department').agg({'Salary': ['mean', 'max'], 'Bonus': ['sum', 'min']})

             Salary         Bonus
               mean    max    sum   min
Department
Finance     41000.0  42000   6500  3000
HR          55000.0  60000  11000  5000
IT          75000.0  80000  22500  7000

## âœ… Step 5: GroupBy with Multiple Columns

In [54]:
df.groupby(['Department', 'Employee'])[['Salary']].sum()

                     Salary
Department Employee
Finance    Frank      40000
           Grace      42000
HR         Alice      50000
           Bob        60000
IT         Charlie    70000
           David      80000
           Eva        75000

In [57]:
df.groupby(['Department', 'Employee'])[['Salary']].max()

                     Salary
Department Employee
Finance    Frank      40000
           Grace      42000
HR         Alice      50000
           Bob        60000
IT         Charlie    70000
           David      80000
           Eva        75000

## âœ… Step 6: Reset Index after Grouping

In [58]:
grouped = df.groupby('Department')['Salary'].mean().reset_index()
grouped

  Department   Salary
0    Finance  41000.0
1         HR  55000.0
2         IT  75000.0

## âœ… Step 7: Using .transform() (Return Same Shape as Original)

In [66]:
# This creates a new column where each row gets the department average
df['AvgDeptSalary'] = df.groupby('Department')['Salary'].transform('mean')

In [60]:
df

  Department Employee  Salary  Bonus  AvgDeptSalary
0         HR    Alice   50000   5000        55000.0
1         HR      Bob   60000   6000        55000.0
2         IT  Charlie   70000   7000        75000.0
3         IT    David   80000   8000        75000.0
4         IT      Eva   75000   7500        75000.0
5    Finance    Frank   40000   3000        41000.0
6    Finance    Grace   42000   3500        41000.0

In [64]:
df['MaxDep_sal']=df.groupby("Department")['Salary'].transform(max)

In [65]:
df

  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal
0         HR    Alice   50000   5000        55000.0       60000
1         HR      Bob   60000   6000        55000.0       60000
2         IT  Charlie   70000   7000        75000.0       80000
3         IT    David   80000   8000        75000.0       80000
4         IT      Eva   75000   7500        75000.0       80000
5    Finance    Frank   40000   3000        41000.0       42000
6    Finance    Grace   42000   3500        41000.0       42000

## âœ… Step 8: Using .filter() to Drop Groups
Example: Only keep departments with total salary > 100000

In [67]:
df_filtered = df.groupby('Department').filter(lambda x: x['Salary'].sum() > 100000)

In [68]:
df_filtered

  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal
0         HR    Alice   50000   5000        55000.0       60000
1         HR      Bob   60000   6000        55000.0       60000
2         IT  Charlie   70000   7000        75000.0       80000
3         IT    David   80000   8000        75000.0       80000
4         IT      Eva   75000   7500        75000.0       80000

In [69]:
df['salary_sum']=df.groupby('Department')['Salary'].transform(sum)

In [70]:
df

  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal  salary_sum
0         HR    Alice   50000   5000        55000.0       60000      110000
1         HR      Bob   60000   6000        55000.0       60000      110000
2         IT  Charlie   70000   7000        75000.0       80000      225000
3         IT    David   80000   8000        75000.0       80000      225000
4         IT      Eva   75000   7500        75000.0       80000      225000
5    Finance    Frank   40000   3000        41000.0       42000       82000
6    Finance    Grace   42000   3500        41000.0       42000       82000

In [74]:
sal_filt=df.groupby('Department').filter(lambda x:x['Salary'].mean() >70000)

In [75]:
sal_filt

  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal  salary_sum
2         IT  Charlie   70000   7000        75000.0       80000      225000
3         IT    David   80000   8000        75000.0       80000      225000
4         IT      Eva   75000   7500        75000.0       80000      225000

## âœ… Step 9: Using .apply() for Custom Logic

In [76]:
def highlight_top_earner(group):
    return group[group['Salary'] == group['Salary'].max()]

df.groupby('Department').apply(highlight_top_earner)

,,Department,Employee,Salary,Bonus,AvgDeptSalary,MaxDep_sal,salary_sum
Department,,,,,,,,
Finance,6,Finance,Grace,42000,3500,41000.0,42000,82000
HR,1,HR,Bob,60000,6000,55000.0,60000,110000
IT,3,IT,David,80000,8000,75000.0,80000,225000

## âœ… Step 10: Named Aggregation (New Columns)

In [81]:
df.groupby('Department').agg(avg_salary=('Salary', 'mean'),total_bonus=('Bonus', 'sum'),)

            avg_salary  total_bonus
Department
Finance        41000.0         6500
HR             55000.0        11000
IT             75000.0        22500

## âœ… Step 11: Sorting Groups

In [83]:
df.groupby('Department')['Salary'].mean().sort_values()

Department
Finance    41000.0
HR         55000.0
IT         75000.0
Name: Salary, dtype: float64

In [84]:
df.groupby('Department')['Salary'].mean().sort_values(ascending=False)

Department
IT         75000.0
HR         55000.0
Finance    41000.0
Name: Salary, dtype: float64

## âœ… Step 12: Get Group Keys

In [87]:
for dept, group_df in df.groupby('Department'):
    print(f"\nDepartment: {dept}")
    print(group_df)

Department: Finance
  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal  salary_sum
5    Finance    Frank   40000   3000        41000.0       42000       82000
6    Finance    Grace   42000   3500        41000.0       42000       82000

Department: HR
  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal  salary_sum
0         HR    Alice   50000   5000        55000.0       60000      110000
1         HR      Bob   60000   6000        55000.0       60000      110000

Department: IT
  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal  salary_sum
2         IT  Charlie   70000   7000        75000.0       80000      225000
3         IT    David   80000   8000        75000.0       80000      225000
4         IT      Eva   75000   7500        75000.0       80000      225000

## âœ… Step 13: Convert GroupBy to Dict of DataFrames

In [88]:
group_dict = dict(tuple(df.groupby('Department')))
group_dict['HR']  # This will give you the HR group as a DataFrame

  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal  salary_sum
0         HR    Alice   50000   5000        55000.0       60000      110000
1         HR      Bob   60000   6000        55000.0       60000      110000

In [89]:
group_dict['IT']

  Department Employee  Salary  Bonus  AvgDeptSalary  MaxDep_sal  salary_sum
2         IT  Charlie   70000   7000        75000.0       80000      225000
3         IT    David   80000   8000        75000.0       80000      225000
4         IT      Eva   75000   7500        75000.0       80000      225000

## âœ… Step 14: Cumulative Operations within Group

In [90]:
df['CumulativeBonus'] = df.groupby('Department')['Bonus'].cumsum()

In [91]:
df

,Department,Employee,Salary,Bonus,AvgDeptSalary,MaxDep_sal,salary_sum,CumulativeBonus
0,HR,Alice,50000,5000,55000.0,60000,110000,5000
1,HR,Bob,60000,6000,55000.0,60000,110000,11000
2,IT,Charlie,70000,7000,75000.0,80000,225000,7000
3,IT,David,80000,8000,75000.0,80000,225000,15000
4,IT,Eva,75000,7500,75000.0,80000,225000,22500
5,Finance,Frank,40000,3000,41000.0,42000,82000,3000
6,Finance,Grace,42000,3500,41000.0,42000,82000,6500

## âœ… Step 15: Count Size of Each Group

In [92]:
df.groupby('Department').size()

Department
Finance    2
HR         2
IT         3
dtype: int64

## or

In [94]:
df.groupby('Department').count()

,Employee,Salary,Bonus,AvgDeptSalary,MaxDep_sal,salary_sum,CumulativeBonus
Department,,,,,,,
Finance,2,2,2,2,2,2,2
HR,2,2,2,2,2,2,2
IT,3,3,3,3,3,3,3

## Letâ€™s dive into hands-on Pandas groupby() practice problems. These will help you master every important concept with realistic scenarios. Iâ€™ll provide the question,

## ðŸ§ª Setup Data

In [95]:
import pandas as pd

data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace'],
    'Salary': [50000, 60000, 70000, 80000, 75000, 40000, 42000],
    'Bonus': [5000, 6000, 7000, 8000, 7500, 3000, 3500],
    'Gender': ['F', 'M', 'M', 'M', 'F', 'M', 'F']
}

df = pd.DataFrame(data)

## âœ… Problem 1: Average Salary by Department
â“ Question: What is the average salary in each department?

ðŸ’¡ Hint: Use groupby() and .mean() on the Salary column.

## âœ… Problem 2: Total Bonus by Gender
â“ Question: How much total bonus is given to males and females?

ðŸ’¡ Hint: Group by Gender and sum the Bonus.

## âœ… Problem 3: Maximum Bonus in Each Department
â“ Question: What is the maximum bonus given in each department?

ðŸ’¡ Hint: Group by Department and use .max().

## âœ… Problem 4: Count of Employees per Department
â“ Question: How many employees are there in each department?

ðŸ’¡ Hint: Use .size() or .count().

## âœ… Problem 5: Get Employees with Highest Salary in Each Department
â“ Question: Find the employee(s) with the highest salary in each department.

ðŸ’¡ Hint: Use .apply() with a custom function like group['Salary'].max().

## âœ… Problem 6: Add Column for Average Salary in Dept (All Rows)
â“ Question: Add a column AvgDeptSalary showing each employee's department's average salary.

ðŸ’¡ Hint: Use .transform('mean').

## âœ… Problem 7: Filter Only High-Earning Departments
â“ Question: Keep only those departments where the total salary is more than 150000.

ðŸ’¡ Hint: Use .filter() with group['Salary'].sum().

## âœ… Problem 8: Multi-Aggregation Summary
â“ Question: For each department, show:

Average salary

Total bonus

Number of employees

ðŸ’¡ Hint: Use .agg() with multiple functions and columns.

## âœ… Problem 9: Sort Departments by Average Bonus (Descending)
â“ Question: Sort the departments by average bonus in descending order.

ðŸ’¡ Hint: Use .groupby()['Bonus'].mean().sort_values().

## âœ… Problem 10: Cumulative Bonus by Department
â“ Question: Add a column CumulativeBonus showing running total of bonus for each department.

ðŸ’¡ Hint: Use .groupby()['Bonus'].cumsum().

## ðŸ§  Bonus Challenge
## âœ… Problem 11: Create a dictionary of DataFrames (one per department)
â“ Question: Convert the grouped departments into a dictionary where keys are department names and values are the DataFrame for each.

ðŸ’¡ Hint: Use dict(tuple(df.groupby('Department')))